[
	{
		"name": "Pulsepoint Scraper",
		"desc": "A python program that scrapes PulsePoint, and can be used to monitor areas for emergency events and notify you when a configured location has an emergency near it.",
		"link": "https://github.com/TrevorBagels/PulsepointScraperV2",
		"time": ["02/21", "03/21"],
		"size": 1,
		"short": "Python program to notify users about specific emergency events."
	}, 
	{
		"name": "JSON4JSON",
		"desc": "A python library that uses json to configure rules for json files. Makes the lives of developers much easier. Can be installed with <code>pip install JSON4JSON</code>",
		"link": "https://github.com/TrevorBagels/JSON4JSON",
		"time": ["02/21", "02/21"],
		"short": "Easier configuration for developers and users.",
		"tags": ["python"],
		"size": 1
	}, 
	{
		"name": "Image Generation",
		"desc": "A large collection of computer generated images. Everything was done using Python, and I programmed every single part of it other than the library to write and save the images.",
		"link": "/projects/imagegen",
		"time": ["9/19", "2/20"],
		"tags": ["python", "creative"],
		"size": 1
	},
	{
		"name": "Case Manager Discord Bot",
		"desc": "A CMS within Discord, ideal for online investigations. The bot handles permissions, cases, divisions, and can even create Google Drive folders automatically and share them with people assigned to a case. ",
		"link": "https://github.com/TrevorBagels/CaseManager",
		"time": ["3/21", "4/21"],
		"short": "Case Management System, all in Discord.",
		"tags": ["python", "discord"],
		"size": 1
	},  
	{
		"name": "Smooth PE Jazz",
		"desc": "A new and crappy genre of music for this new and crappy (no offense) age of society. All of this was generated by a program I wrote in python. Click <a href='https://trevorbagels.github.io/PEJazz.html'>here</a> to view all of the music for this.",
		"link": "/projects/PEJazz.html",
		"date": "2019-4",
		"tags": ["python", "music", "creative"],
		"size": 1
	}, 
	{
		"name": "Soviet Chatbot for Discord",
		"desc": "A Discord bot that utilizes the Cleverbot API and a werid script that I wrote that changes user input to revolve around communism and the Cold War, thus causing the bot to give soviet themed responses. Click <a href='https://discord.com/api/oauth2/authorize?client_id=733025640835448842&permissions=0&scope=bot'>here</a> to invite it to a server. <br>",
		"link": "https://discord.com/api/oauth2/authorize?client_id=733025640835448842&permissions=0&scope=bot",
		"date": "2020-7",
		"tags": ["python", "discord"],
		"size": 1
	}, 
	{
		"name": "Project Epilepsy",
		"desc": "Realtime image generation in JS. It's called project epilepsy to warn people of its dangers before seeing the actual epilepsy warning, which I made in highschool, so it's a bit of an excessive warning. I recommend clicking on the first link at the bottom of the page.",
		"link": "/projects/death/home.html",
		"date": "2019",
		"tags": ["creative", "js"],
		"size": 1
	}, 
	{
		"name": "Music Fingerprinting and Recognition",
		"desc": "A program that utilizes machine learning to compare a given audio file to a database of songs, eventually returning the most similar song in our database. I developed the frontend and backend integration using NodeJS (and a bit of Python), while the other team members focused on the machine learning side of things using Python.",
		"link": "https://github.com/EricZhengLian/NWAPW_music_recognition",
		"date": "2020-7",
		"tags": ["python"],
		"size": 2
	},
	{
		"name": "Faker Interface Bot",
		"desc": "A Discord bot that generates fake information, such as names, addresses, emails, and more.",
		"link": "https://discord.com/oauth2/authorize?client_id=734222377638166638&permissions=2147875904&scope=bot",
		"date": 2020,
		"tags": ["discord", "python"],
		"size": 1
	},
	{
		"name": "Welcome, Primitive Lifeform, To Space",
		"desc": "A tabletop RPG with an extensive amount of lore, as well as a once-WIP videogame (abandoned), as well as a soundtrack/album with different themes for various space things. I haven't touched this project for a year or so, as I've been busy with a lot of other things.",
		"link": "https://theangrybagel.github.io/index.html",
		"date": "2020",
		"tags": ["creative", "abandoned"],
		"size": 2
	}
]